scenario-1/app/controllers/content_controller.rb

SELECT "contents".* FROM "contents"
---
  def index
    render json: Content.all

INSERT INTO "contents" ("data", "created_at", "updated_at") VALUES (?, ?, ?)  [["data", "params require"], ["created_at", "2023-06-22 21:32:25.323237"], ["updated_at", "2023-06-22 21:32:25.323237"]]
---
  def save
    if params[:data].present?
      c = Content.new(params.permit(:data))
      c.save